//
//  MARK: 🪀Work day 66 from 06.06.24
//  Tech Diary
//
//  Created by Халимовский Арсентий Владимирович on 07.06.2024.
//

/*

MARK: - Project Laundry Checklist:

- [ ] mp_snapshot
- [ ] update develop with fresh changes
- [ ] isbol_make
- [ ] rebase Laundry 145 and force push lastest changes
- [ ] get Laundry app from Firebase

MARK: - Tasks:

1. Вынести проект в один отдельный репо по типу старых прачек. ✅
2. Добавление зависимостей в проект


MARK: - Optional:

1. Краевой случай - при сбрасывании приложения на стадии онбординга сбрасывается FaceID (Кроевой случай) ✅
2. Контакты у Коли показываются только 4 штуки, у остальных ребят все  ✅
3. Некорректное сохранение/удаление контактов с главного экрана (как будто не срабатывает анимация обновления контактов)  ✅
4. Переход в карты -> пин -> сначала приближает в море, а затем через 10 секунд на текущую геопозицию пользователя ✅
5. ResultController -> Balance должен быть редактируем ✅
6. Проверить корректность сброса настроек в следствии неудачного входа по face ID (первый на проверку) ✅
7. Связать арифметику баланса и доходов/расходов (второй на реализацию) ✅
8. Добавить таску по локализации календаря -> залить в другой репозитарий ✅




MARK: - Questions to ask:


MARK: - Timers:
1 work timer = 25 minutes of continuous screen time (Pomodoro)

- [x] 1 work timer (daily)
- [x] 2 work timer (work in team)
- [x] 3 work timer (work in team)
- [x] 4 work timer (work in team)
- [x] 5 work timer (work in team)

- [ ] 6 work timer
- [ ] 7 work timer
- [ ] 8 work timer
- [ ] 9 work timer
- [ ] 10 work timer

- [ ] 11 work timer
- [ ] 12 work timer
- [ ] 13 work timer
- [ ] 14 work timer
- [ ] 15 work timer

MARK: - Notes:


*/
